In [1]:
import pandas as pd
import sqlite3

In [2]:
# Conectamos con la base de datos chinook.db
connection = sqlite3.connect("data/sql-murder-mystery.db")

# Obtenemos un cursor que utilizaremos para hacer las queries
crsr = connection.cursor()

In [3]:
def sql_query(query):

    # Ejecuta la query
    crsr.execute(query)

    # Almacena los datos de la query 
    ans = crsr.fetchall()

    # Obtenemos los nombres de las columnas de la tabla
    names = [description[0] for description in crsr.description]

    return pd.DataFrame(ans,columns=names)

In [19]:
pd.set_option("display.max_colwidth", None)

In [20]:
query1 = """
SELECT *  FROM crime_scene_report
WHERE TYPE = 'murder' and city = 'SQL City' and date = 20180115
"""
df = sql_query(query1)
df

,date,type,description,city
0,20180115,murder,"Security footage shows that there were 2 witnesses. The first witness lives at the last house on ""Northwestern Dr"". The second witness, named Annabel, lives somewhere on ""Franklin Ave"".",SQL City

In [28]:
#primer testigo
query1 = """
SELECT * FROM person
where address_street_name = "Northwestern Dr"
"""
df3 = sql_query(query1)
df3[df3["address_number"] == df3["address_number"].max()]

,id,name,license_id,address_number,address_street_name,ssn
2,14887,Morty Schapiro,118009,4919,Northwestern Dr,111564949

In [34]:
query1 = """
SELECT *  FROM interview
where person_id = 14887
"""
df3 = sql_query(query1)
df3

,person_id,transcript
0,14887,"I heard a gunshot and then saw a man run out. He had a ""Get Fit Now Gym"" bag. The membership number on the bag started with ""48Z"". Only gold members have those bags. The man got into a car with a plate that included ""H42W""."

In [25]:
#segundo testigo
query1 = """
SELECT *  FROM person
where name like '%Annabel%' and address_street_name = "Franklin Ave"
"""
df3 = sql_query(query1)
df3

,id,name,license_id,address_number,address_street_name,ssn
0,16371,Annabel Miller,490173,103,Franklin Ave,318771143

In [35]:
query1 = """
SELECT *  FROM interview
where person_id = 16371
"""
df3 = sql_query(query1)
df3

,person_id,transcript
0,16371,"I saw the murder happen, and I recognized the killer from my gym when I was working out last week on January the 9th."

In [38]:
query1 = """
SELECT *  FROM get_fit_now_member
where id like '48Z%' and membership_status = 'gold'
"""
df3 = sql_query(query1)
df3

      id  person_id           name  membership_start_date membership_status
0  48Z7A      28819   Joe Germuska               20160305              gold
1  48Z55      67318  Jeremy Bowers               20160101              gold

In [39]:
query1 = """
SELECT *  FROM drivers_license
where plate_number like '%H42W%'
"""
df3 = sql_query(query1)
df3

,id,age,height,eye_color,hair_color,gender,plate_number,car_make,car_model
0,183779,21,65,blue,blonde,female,H42W0X,Toyota,Prius
1,423327,30,70,brown,brown,male,0H42W2,Chevrolet,Spark LS
2,664760,21,71,black,black,male,4H42WR,Nissan,Altima

In [41]:
query1 = """
SELECT *  FROM person
where id in (28819, 67318)
"""
df3 = sql_query(query1)
df3

,id,name,license_id,address_number,address_street_name,ssn
0,28819,Joe Germuska,173289,111,Fisk Rd,138909730
1,67318,Jeremy Bowers,423327,530,"Washington Pl, Apt 3A",871539279

In [42]:
query1 = """
SELECT * FROM get_fit_now_check_in
where membership_id = '48Z7A'
"""
df3 = sql_query(query1)
df3

  membership_id  check_in_date  check_in_time  check_out_time
0         48Z7A       20180109           1600            1730